Revit 2027 API
EnergyDataSettings.CheckRangeOfShadeDepth Method
Note: This API is now obsolete.
 Checks that the shade depth is greater than or equal to zero.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function CheckRangeOfShadeDepth (
	shadeDepth As Double
) As Boolean
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member CheckRangeOfShadeDepth :
        shadeDepth : float -> bool
Parameters
shadeDepth Double
 The shade depth to be checked.
Return Value
Boolean
 True if the shade depth is greater than or equal to zero, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace